'''Задача 2. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний
 элемент, второй и предпоследний и т.д.

    *Пример:*

    - [2, 3, 4, 5, 6] => [12, 15, 16];
    - [2, 3, 5, 6] => [12, 15]'''

import random

n = int(input("Задайте размер массива: "))
list = [random.randint(1, 9) for _ in range(n)]
list_new = []
i = 0
j = 1
while i < len(list) / 2:
    x = list[i] * list[-j]
    list_new.append(x)
    i += 1
    j += 1
print(f"{list} => {list_new}")

